app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = ?  [["user_id", 2]]
---
    def index
        @documents = current_user.admin? ? Document.all : current_user.documents