app/controllers/documents_controller.rb

INSERT INTO "documents" ("name", "description", "path", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      description = params[:document][:description]
      temp = params[:document][:doc]

      json_temp = JSON.dump({:original_filename => temp.original_filename, :tempfile => temp.tempfile, :path => temp.path})
      @document = current_user.documents.build(:path => json_temp, :description => description)
      if @document.save

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
      if document = Document.find_by_id(params[:id])

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "documents" SET "shared" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["shared", 1], ["updated_at", "2023-06-04 19:43:21.897458"], ["id", 2]]
---
    def update_column
      @document = Document.find(params[:id])
      puts "params #{params}"
      if @document.update_attribute(:shared, params[:column_name])

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 3]]
---
    def destroy
      @document = Document.find(params[:id])
      if @document
        if @document.user_id == session[:user_id]
          @document.destroy