app/controllers/users_controller.rb

    def create
      name = params[:user][:name]
      email = params[:user][:email]
      password = params[:user][:password]
      @user = User.new({:name => name, :email => email, :password => password})
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Shahid"], ["email", "shahidkhan9@gmail.com"], ["password_digest", "[FILTERED]"], ["role", nil], ["created_at", "2023-06-02 09:48:21.983601"], ["updated_at", "2023-06-02 09:48:21.983601"]]

    def destroy
      if User.delete(params[:id]) != 0
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]

    def update
      @user = User.find(params[:id]) # Find the user to update
      puts "user_params :"+params.to_s
      if @user.update(user_params) # Update the user's attributes
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "John Doe @"], ["updated_at", "2023-06-04 20:15:49.888062"], ["id", 1]]